
# SadFsqComm module

DO NOT USE THIS MODULE DIRECTLY !!!  
This documentation is only provided to understand the protocol layer !  

To interface with adxadmin server, please refer to [SadFsqClient module API](https://github.com/Sage-ERP-X3/Syracuse/blob/master/node_modules/syracuse-x3/lib/clients/sadfsq/sadfsqClient.md "SadFsqClient module API").

---
# Connection / Disconnection

This chapter describes connection and disconnection sequences with Safe X3 AdxAdmin server component.

Opening classic TCP/IP socket on 'server:port' with AdxAdmin server.  

##**Connection**  

Two kind of connections protocol are supported :  
- The old SafeV1 protocol :  

  - Request :  
     - **1-byte** : The service ID : 6 by default and 106 for secure mode.  
     - **1-byte** : The length to follow.  
     - **1-byte** : The user string length.  
     - **N-bytes** : The user.
     - **1-byte** : The user string length.  
     - **N-bytes** : The user.  
     - **1-byte** : The password string length.  
     - **N-bytes** : The password
  - Reply :  
     - **4-bytes** : (integer LE) The adonix process PID or -1 if an error occurred.  
     - **[1-byte]** : Only if -1 : The message length.  
     - **[4-bytes]** : Only if -1 : (integer LE) The adonix error code.  
     - **[N-bytes]** : Only if -1 : The error message.  


- The new SafeV2 WIRE protocol : Will be followed by $connections and $sessions request including signature. 

  - Request :  
     - **1-byte** : fixed: 0x00. To say that is Syracuse mode
     - **1-byte** : The service ID : 6 by default and 106 for secure mode.  
     - **1-byte** : fixed: 0x03. The security mode.  
     - **1-byte** : fixed: 0x00. 
  - Reply :  
     - **4-bytes** : (integer LE) The adonix process PID or -1 if an error occurred.  
     - **[1-byte]** : Only if -1 : The message length.  
     - **[4-bytes]** : Only if -1 : (integer LE) The adonix error code.  
     - **[N-bytes]** : Only if -1 : The error message.  

---

##**Disconnection**

Close classic TCP/IP socket with AdxAdmin server.  

  - Request :  
     - **1-byte** : fixed: 0x00. 
     - **1-byte** : order id = 5.  

---

#Remote files management

This chapter describes different sequences that allow to manage remote files with AdxAdmin server component.  


##**Action OUF**

Open remote file.  

   - Request :  
      - **1-byte** : fixed: 0x00. 
      - **2-bytes** : (Short) The length to follow. 
      - **1-byte** : order id = 2. 
      - **2-bytes** : (short) The descriptor buffer length + 2. 
      - **2-bytes** : (short) The descriptor characters count. 
      - **N-bytes** : The descriptor string (utf-8). 
      - **2-bytes** : (short) The open mode buffer length + 2. 
      - **2-bytes** : (short) The open mode characters count. 
      - **N-bytes** : The open mode string (utf-8). 
   - Reply :  
      - **1-bytes** : Identify an error or file number.  

---

##**Action OUS**

Open remote file.  

   - Request :  
      - **1-byte** : fixed: 0x00. 
      - **2-bytes** : (Short) The length to follow. 
      - **1-byte** : order id = 2. 
      - **2-bytes** : (short) The descriptor buffer length + 2. 
      - **2-bytes** : (short) The descriptor characters count. 
      - **N-bytes** : The descriptor string (utf-8). 
      - **4-bytes** : (integer BE) The mod 
      - **4-bytes** : (integer BE) The mask  
   - Reply :  
      - **1-bytes** : Identify an error or file number.  

---

##**Action S_POS**

Get current position in file.  

   - Request :  
      - **1-byte** : The file descriptor identifier.  
      - **2-bytes** : (Short) The length to follow.  
      - **1-byte** : order id = 4.  
   - Reply :  
      - **1-byte** : Identified if an error occurs depending of the value received.  
      - **4-bytes** : (Integer) The current position.  

---

##**Action S_DPL**

Change cursor position in file.  

   - Request :  
      - **1-byte** : The file descriptor identifier.  
      - **2-bytes** : (Short) The length to follow.  
      - **1-byte** : order id = 5.  
      - **1-byte** : base (0:BOF, 1:Curr, 2:EOF).  
      - **4-bytes** : (integer) The offset used to move.  
   - Reply :  
      - **1-byte** : Identified if an error occurs depending of the value received.  

---

##**Action S_VID**

Flush file content.  

   - Request :  
      - **1-byte** : The file descriptor identifier.  
      - **2-bytes** : (Short) The length to follow.  
      - **1-byte** : order id = 2.  
   - Reply :  
      - **1-byte** : Identified if an error occurs depending of the value received.  

---

##**Action S_LCK**

Flush file content.  

   - Request :  
      - **1-byte** : The file descriptor identifier.  
      - **2-bytes** : (Short) The length to follow.  
      - **1-byte** : order id = 13.  
      - **1-byte** : The lock type.  
      - **4-bytes** : The lock position.  
      - **4-bytes** : Number of characters that are concerned.  
   - Reply :  
      - **1-byte** : Identified if an error occurs depending of the value received.  

---

##**Action T_REN**

Rename a remote file.  

   - Request :  
      - **1-byte** : fixed: 0x00.  
      - **2-bytes** : (Short) The length to follow.  
      - **1-byte** : order id = 19.  
      - **2-bytes** : (short) The old descriptor buffer length + 2.  
      - **2-bytes** : (short) The old descriptor characters count.  
      - **N-bytes** : The old descriptor string (utf-8).  
      - **2-bytes** : (short) The new descriptor buffer length + 2.  
      - **2-bytes** : (short) The new descriptor characters count.  
      - **N-bytes** : The new descriptor string (utf-8).  
   - Reply :  
      - **1-byte** : Identified if an error occurs depending of the value received.  

---

##**Action S_TFF**

check if is end of file  

   - Request :  
      - **1-byte** : The file descriptor identifier.  
      - **2-bytes** : (Short) The length to follow.  
      - **1-byte** : order id = 2.  
   - Reply :  
      - **1-byte** : Identified if an error occurs depending of the value received.  

---

##**Action S_FER**

Close remote opened file.  

   - Request :  
      - **1-byte** : The file descriptor identifier. 
      - **2-bytes** : (Short) The length to follow. 
      - **1-byte** : order id = 1. 
   - Reply :  
      - **1-byte** : The error code.  

---

##**Action PAT**

Get remote file path.  

   - Request :  
      - **1-byte** : fixed: 0x00. 
      - **2-bytes** : (Short) The length to follow. 
      - **1-byte** : order id = 8. 
      - **2-bytes** : (short) The descriptor buffer length + 2. 
      - **2-bytes** : (short) The descriptor characters count. 
      - **N-bytes** : The descriptor string (utf-8). 
   - Reply :  
      - **1-byte** : Identified if an error occurs depending of the value received or the length of the path string.  
      - **N-bytes** : The path string.  

---

##**Action PRM**

Get file information.  

   - Request :  
      - **1-byte** : fixed: 0x00. : 
      - **2-bytes** : (Short) The length to follow.  
      - **1-byte** : order id = 7.  
      - **1-byte** : info id. Can be 'size' (8) or 'stamp' (10).  
      - **2-bytes** : (short) The descriptor buffer length + 2.  
      - **2-bytes** : (short) The descriptor characters count.  
      - **N-bytes** : The descriptor string (utf-8).  
   - Reply :  
      - **1-byte** : Identified if an error occurs depending of the value received or the value of the info Id (serialized in unsigned integer).  
      - **4-bytes** : Value of the info Id (serialized in integer Big Endian).  

---

##**Action S_LBF**

Read all buffer from remote file.  

   - Request :  
      - **1-byte** : The file descriptor identifier.  
      - **2-bytes** : (Short) The length to follow.  
      - **1-byte** : order id = 5.  
      - **4-bytes** : (integer) The length to read.  
   - Reply :  
      - **1-byte** : Identified if an error occurs depending of the value received.  
      - **4-bytes** : Buffer size to read (serialised in integer Big Endian).  
      - **n-bytes** : Part of the file content in bytes.  

---

##**Action S_EBF**

Write buffer to remote file file.  

   - Request :  
      - **1-byte** : The file descriptor identifier. 
      - **2-bytes** : (Short) The length to follow. 
      - **1-byte** : order id = 8. 
      - **4-bytes** : (integer) The length of the binary to write. 
      - **N-bytes** : The binary content. 
   - Reply :  
      - **1-byte** : Identified if an error occurs depending of the value received.  

---

##**Action EFF**

Delete remote file.  

   - Request :  
      - **1-byte** : fixed: 0x00. 
      - **2-bytes** : (Short) The length to follow. 
      - **1-byte** : order id = 10. 
      - **2-bytes** : (short) The descriptor buffer length + 2. 
      - **2-bytes** : (short) The descriptor characters count. 
      - **N-bytes** : The descriptor string (utf-8). 
   - Reply :  
      - **1-byte** : Identified if an error occurs depending of the value received.  

---

#Remote processes management

This chapter describes different sequences that allow to manage remote processes with AdxAdmin server component.  


##**Action OUP**

Open remote process.  

   - Request :  
      - **1-byte** : fixed: 0x00. 
      - **2-bytes** : (Short) The length to follow. 
      - **1-byte** : order id = 4. 
      - **2-bytes** : (short) The command line buffer length + 2. 
      - **2-bytes** : (short) The command line characters count. 
      - **N-bytes** : The command line string (utf-8). 
      - **2-bytes** : (short) The open mode buffer length + 2. 
      - **2-bytes** : (short) The open mode characters count. 
      - **N-bytes** : The open mode string (utf-8). 
   - Reply :  
      - **1-byte** : Identify an error occurs depending of the value else file number.  

---

##**Action KUS**

Kill remote process.  

   - Request :  
      - **1-byte** : fixed: 0x00. 
      - **2-bytes** : (Short) The length to follow. 
      - **1-byte** : order id = 7. 
      - **1-byte** : signal.
      - **4-bytes** : (integer) PID. 
   - Reply :  
      - **1-byte** : Identified if an error occurs depending of the value received.  

---

##**Action ERR**

Get error.  

   - Request :  
      - **1-byte** : fixed: 0x00.  
      - **2-bytes** : (Short) The length to follow. fixed: 0x00,0x01  
      - **1-byte** : order id = 6.  
   - Reply :  
      - **1-byte** : fixed: 0x00. indicate this is an error.  
	  - **n-bytes** : error message encoded in utf-8.  

---

