
# SadFsqComm module

DO NOT USE THIS MODULE DIRECTLY !!!  
This documentation is only provided to understand the protocol layer !  

To interface with adxadmin server, please refer to [SadFsqClient module API](https://github.com/Sage-ERP-X3/Syracuse/blob/master/node_modules/syracuse-adxadmin/lib/sadfsq/sadfsqClient.md "SadFsqClient module API").

---
# Connection / Disconnection

This chapter describes connection and disconnection sequences with Safe X3 AdxAdmin server component.


##**Connection**

Opening classic TCP/IP socket on 'server:port' with AdxAdmin server.  

  - **First step** : open session.  
  - Request :  
     - **1-byte** : The service ID : 6 by default and 106 for secure mode.  
     - **1-byte** : The length to follow.  
     - **1-byte** : The user string length.  
     - **N-bytes** : The user.  
     - **1-byte** : The user string length.  
     - **N-bytes** : The user.  	
     - **1-byte** : The password string length.  
     - **N-bytes** : The password
  - Reply :  
     - **X-bytes** : TODO.  

---

#Remote files management

This chapter describes different sequences that allow to manage remote files with AdxAdmin server component.  


##**Action T_OUF**

Open remote file.  

   - Request :  
      - **1-byte** : fixed: 0x00. 
      - **2-bytes** : (Short) The length to follow. 
      - **1-byte** : order id = 2. 
      - **2-bytes** : (short) The descriptor buffer length + 2. 
      - **2-bytes** : (short) The descriptor characters count. 
      - **N-bytes** : The descriptor string (utf-8). 
      - **2-bytes** : (short) The open mode buffer length + 2. 
      - **2-bytes** : (short) The open mode characters count. 
      - **N-bytes** : The open mode string (utf-8). 
   - Reply :  
      - **X-bytes** : TODO.  

---

##**Action S_FER**

Close remote opened file.  

   - Request :  
      - **1-byte** : The file descriptor identifier. 
      - **2-bytes** : (Short) The length to follow. 
      - **1-byte** : order id = 1. 
   - Reply :  
      - **X-bytes** : TODO.  

---

##**Action T_PAT**

Get remote file path.  

   - Request :  
      - **1-byte** : fixed: 0x00. 
      - **2-bytes** : (Short) The length to follow. 
      - **1-byte** : order id = 8. 
      - **2-bytes** : (short) The descriptor buffer length + 2. 
      - **2-bytes** : (short) The descriptor characters count. 
      - **N-bytes** : The descriptor string (utf-8). 
   - Reply :  
      - **X-bytes** : TODO.  

---

##**Action T_PRM**

Get file information.  

   - Request :  
      - **1-byte** : fixed: 0x00. 
      - **2-bytes** : (Short) The length to follow. 
      - **1-byte** : order id = 7. 
      - **1-byte** : info id. Can be 'size' (8) or 'stamp' (10)
      - **2-bytes** : (short) The descriptor buffer length + 2. 
      - **2-bytes** : (short) The descriptor characters count. 
      - **N-bytes** : The descriptor string (utf-8). 
   - Reply :  
      - **X-bytes** : TODO.  

---

##**Action S_LBF**

Read all buffer from remote file.  

   - Request :  
      - **1-byte** : The file descriptor identifier. 
      - **2-bytes** : (Short) The length to follow. 
      - **1-byte** : order id = 5. 
      - **4-bytes** : (integer) The length to read. 
   - Reply :  
      - **X-bytes** : TODO.  

---

##**Action S_EBF**

Write buffer to remote file file.  

   - Request :  
      - **1-byte** : The file descriptor identifier. 
      - **2-bytes** : (Short) The length to follow. 
      - **1-byte** : order id = 8. 
      - **4-bytes** : (integer) The length of the binary to write. 
      - **N-bytes** : The binary content. 
   - Reply :  
      - **X-bytes** : TODO.  

---

##**Action T_EFF**

Delete remote file.  

   - Request :  
      - **1-byte** : fixed: 0x00. 
      - **2-bytes** : (Short) The length to follow. 
      - **1-byte** : order id = 10. 
      - **2-bytes** : (short) The descriptor buffer length + 2. 
      - **2-bytes** : (short) The descriptor characters count. 
      - **N-bytes** : The descriptor string (utf-8). 
   - Reply :  
      - **X-bytes** : TODO.  

---

##**Action T_OUP**

Open remote process.  

   - Request :  
      - **1-byte** : fixed: 0x00. 
      - **2-bytes** : (Short) The length to follow. 
      - **1-byte** : order id = 4. 
      - **2-bytes** : (short) The command line buffer length + 2. 
      - **2-bytes** : (short) The command line characters count. 
      - **N-bytes** : The command line string (utf-8). 
      - **2-bytes** : (short) The open mode buffer length + 2. 
      - **2-bytes** : (short) The open mode characters count. 
      - **N-bytes** : The open mode string (utf-8). 
   - Reply :  
      - **X-bytes** : TODO.  

---

##**Action T_KUS**

Kill remote processus.  

   - Request :  
      - **1-byte** : fixed: 0x00. 
      - **2-bytes** : (Short) The length to follow. 
      - **1-byte** : order id = 7. 
      - **1-byte** : signal.
      - **4-bytes** : (integer) PID. 
   - Reply :  
      - **X-bytes** : TODO.  

---

##**Action T_ERR**

Get error.  

   - Request :  
      - **1-byte** : fixed: 0x00. 
      - **2-bytes** : (Short) The length to follow. fixed: 0x00,0x01 
      - **1-byte** : order id = 6. 
   - Reply :  
      - **X-bytes** : TODO.  

---

