Repository: ltrgithub/X3GestAA
Catalog: dotnet/ExcelAddIn/Ribbon.*.resx
Languages: pt

# buttonRefreshReport.Label
source: Refresh
pt: Atualizar

# buttonPreview.Label
source: Preview
pt: Pré-visualizar

# checkBoxShowTemplatePane.Label
source: Show fields
pt: Afixar os campos

# calculateSumButton.Label
source: Calculate sum
pt: Calcular a soma

# dropDownLocale.SizeString
source: de-DE - Deutsch (Deutschland)
pt: Português (Portugal) pt-PT

# actionPanelCheckBox.Label
source: Show action panel
pt: Mostar o painel de ações

# ribbonDropDownItemImpl2.Label
source: Excel report template
pt: Inserção de linhas

# ribbonDropDownItemImpl3.Label
source: Do nothing
pt: Não fazer nada

# dropDownInsert.Label
source: On table grow
pt: Aumentar o quadro

# ribbonDropDownItemImpl4.Label
source: Delete cells
pt: Supressão das células

# ribbonDropDownItemImpl5.Label
source: Delete rows
pt: Supressão das linhas

# ribbonDropDownItemImpl6.Label
source: Do nothing
pt: Não fazer nada

# dropDownDelete.Label
source: On table shrink
pt: Reduzir o quadro

# groupSageX3.Label
source: Options
pt: Opções

# buttonUpdate.Label
source: Update Add-in
pt: Atualizar o Add-in

# groupVersion.Label
source: Version
pt: Versão

# buttonCleanup.Label
source: Cleanup Template Metadata
pt: Limpar o modelo metadata

# cleanupTemplateGroup.Label
source: Advanced
pt: Avançado

# ribbonDropDownItem1.Label
source: Shift cells down
pt: Deslocar as células para baixo

# ribbonDropDownItem2.Label
source: Insert rows
pt: Inserir linhas

# ribbonDropDownItem3.Label
source: Do nothing
pt: Não fazer nada

# ribbonDropDownItem5.Label
source: Delete rows
pt: Suprimir as linhas

# ribbonDropDownItem4.Label
source: Delete cells
pt: Suprimir as células

# ribbonDropDownItem6.Label
source: Do nothing
pt: Não fazer nada

# comboBoxServerLocation.Label
source: Server location
pt: Localização servidor

# comboBoxServerLocation.ScreenTip
source: Enter the server URL as http(s)://servername:port.
pt: Deve registar o URL sob a forma http(s)://servername:port.

# comboBoxServerLocation.SuperTip
source: If you do not know this information, contact your system administrator.
pt: Se não conhecer esta informação, deve contactar o administrador de sistemas.
