Repository: ltrgithub/X3GestAA
Catalog: dotnet/PowerPointAddIn/Ribbon.*.resx
Languages: es

# buttonRefreshAll.Label
source: Refresh all slides
es: Actualizar todas las diapositivas

# groupVersion.Label
source: Version
es: Versión

# buttonRefresh.Label
source: Refresh slide
es: Actualizar la diapositiva

# buttonUpdate.Label
source: Update Add-in
es: Actualizar el Add-in

# buttonRefreshAll.ScreenTip
source: Refresh all charts linked to Sage X3
es: Actualizar todos los gráficos asociados a Sage

# buttonRefresh.ScreenTip
source: Refresh charts linked to Sage X3 on active slide
es: Actuallizar los gráficos asociados a Sage en la diapositiva actual

# comboBoxServerLocation.Label
source: Server location
es: Ubicación servidor

# comboBoxServerLocation.ScreenTip
source: Enter the server URL as http(s)://servername:port.
es: Introduzca la URL del servidor con el formato http(s)://nombreserver:port.

# comboBoxServerLocation.SuperTip
source: If you do not know this information, contact your system administrator.
es: Si no conoce esta información, contacte con su administrador de sistema.

# buttonPublish.Label
source: Publish
es: Publicado

# ribbonDropDownItemImpl1.Label
source: Document
es: Documento

# galleryPublishAs.Label
source: Publish as...
es: Publicado como ...

# groupPublish.Label
source: Publish document
es: Documento publicado

# groupSettings.Label
source: Server settings
es: Parametrización servidor
