Repository: ltrgithub/X3GestAA
Catalog: dotnet/ExcelAddIn/Properties/Resources.*.resx
Languages: de, fr

# MSG_SAVE_AS
source: Warning, the document will be saved on your workstation but not in the X3 base. To publish it in the X3 base, click “No” then use the “Publish” button. Do you wish to continue?
de: Diese Mappe ist bereits in X3 veröffentlicht und wird in X3 gespeichert. Wenn sie eine lokale Kopie anlegen möchten, verwenden Sie bitte die "Speichern unter..."-Funktion. Möchten Sie mit dem Speichern fortfahren?
fr: Ce classeur est publié sous X3 où il sera enregistré. Si vous voulez enregistrer une copie, utilisez la fonction "Enregistrer sous".

# MSG_SAVE_AS_TITLE
source: Save workbook
de: Speichern
fr: Enregistrer le classeur

# AddinTitle
source: Sage X3 for Office
de: Sage X3 für Office
fr: Sage X3 pour Office

# CreateTableError
source: Cannot create a table with {0} columns and {1} rows. Please check your insert preferences.{3}(Error was: "{2}")
de: Es konnte keine Tabelle mit {0} Spalten und {1} Zeilen angelegt werden.{3} (Fehler: "{2}")
fr: Impossible de créér un tableau avec {0} colonnes et {1} lignes. Veuillez vérifier vos préférences d'insertion.{3}(L'erreur était: "{2}")

# DeleteCellsError
source: Cannot shift up {0} columns and {1} rows. The range value are cleared.{3}(Error was: "{2}")
de: Fehler beim Entfernen von {0} Spalten und {1} Zeilen.{3}(Fehler: "{2}")
fr: Erreur lors de la suppression de {0} colonnes et de {1} lignes. Les valeurs de bornes sont effacées.{3} (L'erreur était : "{2}")

# InsertCellsError
source: Cannot shift down {0} columns and {1} rows, the range might overlap another table. Please check your insert preferences.{3}(Error was: "{2}")
de: Fehler beim Einfügen von {0} Spalten und {1} Zeilen. Eventuell gibt es Überlappungen mit einer anderen Tabelle.{3}(Fehler: "{2}")
fr: Erreur lors de l'insertion de {0} colonnes et de {1} lignes, les bornes risquent de chevaucher un autre tableau. Veuillez vérifier vos préférences d'insertion.{3}(L'erreur était: "{2}")

# InsertRowsError
source: Cannot insert {0} rows, the range might overlap another table. Please check your insert preferences.{2}(Error was: "{1}")
de: Fehler beim Einfügen von {0} Zeilen. Eventuell gibt es Überlappungen mit einer anderen Tabelle.{2}(Fehler: "{1}")
fr: Erreur lors de l'insertion de {0} lignes, les bornes risquent de chevaucher un autre tableau. Veuillez vérifier vos préférences d'insertion.{3}(L'erreur était: "{1}")

# ResizeTableError
source: Cannot resize a table with {0} columns and {1} rows. Please check Your insert preferences. (Error was: "{2}")
de: Die Größe der Tabelle konnte nicht auf {0} Spalten und {1} Zeilen gesetzt werden. Bitte prüfen Sie die Einfügeoptionen. (Fehler: "{2}")
fr: Impossible de redimensionner un tableau avec {0} colonnes et {1} lignes. Veuillez vérifier vos préférences d'insertion.

# OverrideTableConfirm
source: The reference "{0}" is allready associated with table "{1}". Do You want to delete table "{1}" and replace its content ?
de: Die Zelle "{0}" wurde bereits in Verbindung mit Tabelle "{1}" benutzt. Wollen Sie die Tabelle "{1}" löschen und den Inhalt ersetzen?
fr: La référence "{0}" est déjà utilisée en association avec le tableau "{1}".Voulez-vous supprimer le tableau "{1}" et remplacer son contenu ?

# MSG_NEW_VERSION
source: New Addin available. Do do want to install it?
de: Neues Addin verfügbar. Wollen Sie es installieren?
fr: Nouvel Add-in disponible. Voulez-vous l'installer ?

# MSG_NEW_VERSION_TITLE
source: Install new version?
de: Installiere neue Version?
fr: Installer la nouvelle version ?

# MSG_RESTART
source: Please restart your Excel after the installation of the new Addin.
de: Bitte starten Sie Ihre Excel-Anwendung nach der Installation des Addin neu.
fr: Veuillez relancer Excel après avoir installé le nouvel Add-in.

# MSG_RESTART_TITLE
source: Restart Excel
de: Neustart Excel
fr: Relancer Excel

# MSG_INVALID_SERVER_URL
source: The specified server location is invalid
de: Die angeforderte Ressource konnte nicht gefunden werden

# MSG_INVALID_SERVER_URL_TITLE
source: Invalid server location
de: Ungültige Ressource

# InitializationError
source: Error initializing Excel Addin: {0}.
fr: Erreur d'initialisation de l'addin Excel: {0}
